	*>SOURCE FORMAT FREE
	IDENTIFICATION DIVISION.
	PROGRAM-ID. COBOLlvl2.
	AUTHOR. Loren Stevenson.
	DATE-WRITTEN. June 8th, 2021.
	ENVIRONMENT DIVISION.

	DATA DIVISION.
	FILE SECTION.
	WORKING-STORAGE SECTION.
	01 SampleData PIC X(10) VALUE "Stuff".
	01 JustLetters PIC AAA VALUE "ABC".
	01 JustNums PIC 9(4) VALUE 1234.
	01 SignedInt PIC S9(4) VALUE -1234.
	01 PayCheck PIC 9(4)V99 VALUE ZEROS.
	01 Customer.
		02 Ident	PIC 9(3).
		02 CustName	PIC X(20).
		02 DateofBirth.
			03 MOB PIC 99.
			03 DOB PIC 99.
			03 YOB PIC 9(4).
	01 Num1 PIC 9 VALUE ZEROS.
	01 Num2 PIC 9 VALUE ZEROS.
	01 Num3 PIC 9 VALUE ZEROS.
	01 Ans PIC S99V99 VALUE 0.
	01 An2 PIC S99V99 VALUE 0.
	01 Rem PIC 9V99.


	PROCEDURE DIVISION.
	MOVE "More Stuff" TO SampleData
	MOVE "123" TO SampleData
	MOVE 123 TO SampleData
	DISPLAY SampleData
	DISPLAY PayCheck
	DISPLAY "What is your name? "
	ACCEPT CustName
	DISPLAY "Hello, " CustName
	MOVE "123" TO Ident
	Display "What is the Month of your birth?"
	ACCEPT MOB
	DISPLAY "What is the Day of your birth?"
	ACCEPT DOB
	DISPLAY "What year were your born?"
	ACCEPT YOB
	DISPLAY MOB "/" DOB "/" YOB
	DISPLAY "Select Variables"
	ACCEPT Num1
	ACCEPT Num2
	ACCEPT Num3
	ADD Num1 TO Num2 GIVING Ans
	DISPLAY Num1 "+" Num2 "=" Ans
	SUBTRACT Num1 FROM Num2 GIVING Ans
	DISPLAY Num1 "-" Num3 "=" Ans
	MULTIPLY Num1 BY Num2 GIVING Ans
	DISPLAY Num1 "*" Num2 "=" Ans
	DIVIDE Num3 INTO Num2 GIVING Ans
	DISPLAY Num1 "/" Num2 "=" Ans
	DIVIDE Num1 INTO Num2 GIVING Ans REMAINDER Rem
	DISPLAY "Remainder " Rem


	STOP RUN.
	