		*>How To COBOL
	IDENTIFICATION DIVISION.
	PROGRAM-ID. C4Res.
	AUTHOR. Loren Stevenson.
	DATE-WRITTEN. 7/7/2021.
	ENVIRONMENT DIVISION.
	INPUT-OUTPUT SECTION.
	FILE-CONTROL.
	DATA DIVISION.
	FILE SECTION.
	WORKING-STORAGE SECTION.
	PROCEDURE DIVISION.
	