	>>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. ratingdatabase.
AUTHOR. Loren Stevenson.
DATE-WRITTEN. July 7, 2021.


ENVIRONMENT DIVISION.
CONFIGURATION SECTION.

	
DATA DIVISION.
WORKING-STORAGE SECTION.


FILE SECTION.


WORKING-STORAGE SECTION.
PROCEDURE DIVISION.

END PROGRAM sample.


